import kotlin.text.Regex

fun main() {
    val text = """মানযিল মূলত কুরআনে নির্বাচিত কিছু আয়াতের সমষ্টি। কুরআনের ১৮ টি স্থান থেকে মোট ৭৯ টি আয়াত নিয়ে প্রস্তুত হয়েছে মানযিল। যথা:

১. সূরা ফাতেহা, ৭ আয়াত
২. সূরা বাকারার শুরুর ৫ আয়াত
৩. সূরা বাকারার ১৬৩ নং আয়াত
৪. সূরা বাকারা আয়াত নং ২৫৫, ২৫৬ ও ২৫৭, অর্থাৎ আয়াতুল কুরসী ও তার পরবর্তী ২ আয়াত
৫. সূরা বাকারার শেষ ৩ আয়াত, আয়াত নং ২৮৪, ২৮৫ ও ২৮৬
৬. সূরা আলে ইমরান এর ১৮ নং আয়াত
৭. সূরা আলে ইমরান এর ২৬ ও ২৭ নং আয়াত
৮. সূরা আরাফ এর ৫۴, ৫৫ ও ৫৬ নং আয়াত
৯. সূরা বনী ইসরাঈল এর শেষ ২ আয়াত, ১১০ ও ১১১ নং আয়াত
১০. সূরা মুমিনুন এর শেষ ৪ আয়াত, ১১৫, ১১৬, ১১৭ ও ১১৮ নং আয়াত
১১. সূরা সাফ্ফাত এর শুরু থেকে ১১ আয়াত
১২. সূরা রহমান এর ৩৩ থেকে ৪০ পর্যন্ত, মোট ৮ আয়াত
১৩. সূরা হাশর এর শেষ ৪ আয়াত। ২১, ২২, ২৩ ও ২৪ নং আয়াত
১৪. সূরা জ্বিন এর শুরুর ৪ আয়াত
১৫. সূরা কাফিরুন, মোট ৬ আয়াত
১৬. সূরা ইখলাস, মোট ৪ আয়াত
১৭. সূরা ফালাক্ব, মোট ৫ আয়াত
১৮. সূরা নাস, মোট ৬ আয়াত

আমাদের সমাজের দ্বীনদার শ্রেণীর মাঝে ‘মানযিল’ এর আয়াত সমষ্টি তেলাওয়াতের আমল প্রচলিত আছে। উলামায়ে কিরামও এ আমল করার প্রতি উৎসাহিত করে থাকেন।

আমাদের জানামতে মানযিল নামে এ আমলের প্রচলন মূলত শাইখুল হাদীস মাওলানা যাকারিয়া কান্ধলভী রহ. (মৃত ১৪০২) এর মাধ্যমে। এটি শাইখুল হাদীস রহ. এর বংশের বুজুর্গদের আমল ছিল। আমাদের বাজারে যে মনযিল নামে ছোট পুস্তিকা পাওয়া যায় তা মূলত শাইখুল হাদীস মাওলানা যাকারিয়া রহ. এর সাহেবজাদা মাওলানা তালহা কান্ধলভী রহ. এর উদ্যোগে প্রথম প্রকাশিত হয়েছিল। পরবর্তীতে তার অনুকরণে অরো অনেক প্রকাশক ছাপার উদ্যোগ নিয়েছেন।

হযরত মাওলানা তালহা কান্ধলভী রহ. এ পুস্তিকার ভূমিকায় লিখেছেন,
আমাদের ঘরের নারীরা যখন কোন অসুস্থ নারীর জন্য মনযিল এর আমল দিতেন তখন তাদের মূল কুরআনে চিহ্নিত করে দিতে হত। তাই ইচ্ছা হল যে, এটিকে ভিন্নভাবে পাছানোর উদ্যোগ নেওয়া হোক, তাহলে তাদেরকে আমলটি বলে দেওয়া সহজ হবে। [মানযিল পৃষ্ঠা ৩]

অবশ্য এরও আগে শাহ ওয়ালি উল্লাহ দেহলভী রহ. (মৃত ১১৭৬) এর বংশেও এ আমলের কথা পাওয়া যায়। তবে তাদের সময় এ আমল ‘৩৩ আয়াতের আমল’ নামে পরিচিত ছিল। যার সাথে আমাদের প্রচলিত মানযিলের আয়াত সংখ্যার কিছু পার্থক্য রয়েছে। এর আলোচনা একটু পরেই আসছে।

এ আমলের ফযিলত ও বৈশিষ্ট্য

এক.
এতে সন্দেহের কোন অবকাশ নেই যে কুরআন তিলাওয়াত সর্বোত্তম যিকির। এর প্রতি অক্ষর তিলাওয়াতের বিনিময়ে কমপক্ষে দশ নেকি লাভ হয়। হযরত আব্দুল্লাহ ইবনে মাসউদ রা. বলেন, রাসূল সা. বলেছেন, যে ব্যক্তি কুরআনের একটি হরফ তিলাওয়াত করবে সে একটি নেকি লাভ করবে। আর একটি নেকি দশটি নেকিতে বৃদ্ধি করা হবে। আমি বলছি না ‘আলিফ লাম মিম’ একটি হরফ; বরং ‘আলিফ’ একটি হরফ, ‘লাম’ একটি হরফ ও ‘মিম’ একটি হরফ। [সুনানে তিরমিযী ২৯১০, সনদ সহীহ]
তাই মানযিল এর নির্বাচিত কিছু আয়াত তিলাওয়াত করলে অবশ্যই উল্লেখিত সওয়াব লাভ হবে।

দুই.
পাশাপাশি এর যে সকল আয়াতের ব্যাপারে ভিন্ন কোন ফযিলত ও বৈশিষ্ট্যের কথা হাদীসে রয়েছে তেলাওয়াতের মাধ্যমে তাও লাভ হবে। নিচে উদাহরণ স্বরূপ এমন কিছু নির্ভরযোগ্য হাদীসের উদ্ধৃতি পেশ করা হল।

সূরা ফাতেহা সম্পর্কে : আবূ সা’ঈদ খুদরী রা. বর্ণনা করেছেন। তিনি বলেন, একবার আমরা সফরে চলছিলাম। পথিমধ্যে অবতরণ করলাম। তখন একটি বালিকা এসে বলল, এখানকার গোত্রের সরদারকে সাপে কেটেছে। আমাদের পুরুষগণ বাড়িতে নেই। অতএব, আপনাদের মধ্যে এমন কেউ আছেন কি, যিনি ঝাড়-ফুঁক করতে পারেন? তখন আমাদের মধ্য থেকে একজন ঐ বালিকাটির সঙ্গে গেলেন। যদিও আমরা ভাবিনি যে সে ঝাড়-ফুঁক জানে। এরপর সে ঝাড়-ফুঁক করল এবং গোত্রের সরদার সুস্থ হয়ে উঠল। এতে সর্দার খুশী হয়ে তাকে ত্রিশটি বকরী দান করলেন এবং আমাদের সকলকে দুধ পান করালেন। ফিরে আসার পথে আমারা জিজ্ঞেস করলাম, তুমি ভালভাবে ঝাড়-ফুঁক করতে জান? সে উত্তর করল, না, আমি তো কেবল উম্মুল কিতাব- সূরা ফাতিহা দিয়েই ঝাড়-ফুঁক করেছি। আমরা তখন বললাম, যতক্ষণ না আমরা নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর কাছে পৌঁছে তাঁকে জিজ্ঞেস করি ততক্ষণ কেউ কিছু বলবে না। এরপর আমরা মদিনায় পৌঁছে নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর কাছে ঘটনাটি বললাম। তিনি বললেন, সে কেমন করে জানল যে, তা (সূরা ফাতিহা) রোগ আরোগ্যের জন্য ব্যবহার করা যেতে পারে? তোমরা নিজেদের মধ্যে এগুলো বণ্টন করে নাও এবং আমার জন্যও একটা ভাগ রেখো। [সহীহ বুখারী ৫০০৭]

সূরা বাকারা সম্পর্কে : আবূ হুরায়রাহ রা. বর্ণনা করেছেন, রসূলুল্লাহ সা. বলেছেন, তোমাদের ঘরসমূহকে কবর সদৃশ করে রেখো না, কারণ যে ঘরে সূরাহ্ বাক্বারাহ্ পাঠ করা হয় শয়তান সে ঘর থেকে পালিয়ে যায়। [সহীহ মুসলিম ৭৮০]

সূরা বাকারার শেষ দুই আয়াত সম্পর্কে : ১. হযরত আবু মাসউদ রা. বলেন, রাসূলুল্লাহ সা. বলেছেন, যে ব্যক্তি কোন রাতে সূরা বাকারার শেষ দুই আয়াত পাঠ করবে তার জন্য তা যথেষ্ট হয়ে যাবে। [সহীহ বুখারী ৪০০৮, ৫০০৮, ৫০৪০]

২. নু‘মান ইবনু বাশীর রা. বর্ণনা করেছেন, নবী সা. বলেছেন, আল্লাহ তা‘আলা আসমান-জামিন সৃষ্টির দুই হাজার বছর পূর্বে একটি কিতাব লিখেছেন। সেই কিতাব হতে তিনি দু‘টি আয়াত নাযিল করছেন। সেই দু‘টি আয়াতের মাধ্যমেই সূরা আল-বাক্বারা সমাপ্ত করেছেন। যে ঘরে তিন রাত এ দু‘টি আয়াত তিলাওয়াত করা হয় শয়তান সেই ঘরের নিকট আসতে পারে না। [সুনানে তিরমিযী ২৮৮২, মুসনাদে আহমদ ১৮৪১৪, সনদ সহীহ]

সূরা ফাতেহা ও সূরা বাকারার শেষাংশ সম্পর্কে : আবদুল্লাহ ইবনু আব্বাস রা. বর্ণনা করেছেন, তিনি বলেন, একদিন জিবরাঈল আ. নবী সা. এর কাছে বসেছিলেন। সে সময় তিনি উপর দিক থেকে দরজা খোলার একটা প্রচণ্ড আওয়াজ শুনতে পেয়ে মাথা উঠিয়ে বললেন, এটি আসমানের একটি দরজা। আজকেই এটি খোলা হলো- ইতোপূর্বে আর কখনো খোলা হয়নি। আর এ দরজা দিয়ে একজন ফেরেশতা পৃথিবীতে নেমে আসলেন। আজকের এ দিনের আগে আর কখনো তিনি পৃথিবীতে আসেননি। তারপর তিনি সালাম দিয়ে বললেন, আপনি আপনাকে দেয়া দু’টি নূর বা আলোর সুসংবাদ গ্রহণ করুন। আপনার পূর্বে আর কোন নবীকে তা দেয়া হয়নি। আর ঐ দু’টি নূর হলো সূরা ফাতিহা এবং সূরা আল বাক্বারাহ্ এর শেষাংশ। এর যে কোন হরফ আপনি পড়বেন তার মধ্যকার প্রার্থিত বিষয় আপনাকে দেয়া হবে। [সহীহ মুসলিম ৮০৬]

আয়াতুল কুরসী সম্পর্কে : আবূ হুরায়রা (রাঃ) বর্ণনা করেছেন, তিনি বলেন, আল্লাহর রাসূল সা. আমাকে রমযানের যাকাত (সাদাকাতুল ফিতরের) হিফাজতের দায়িত্ব প্রদান করলেন। অতঃপর আমার নিকট এক আগন্তুক আসল। সে তার দু’হাতের আঁজলা ভরে খাদ্যশস্য গ্রহণ করতে লাগল। তখন আমি তাকে ধরে ফেললাম এবং বললাম, আমি অবশ্যই তোমাকে আল্লাহর রাসূল সা. এর নিকট নিয়ে যাব। তখন সে একটি হাদীস উল্লেখ করল এবং বলল, যখন তুমি বিছানায় শুতে যাবে, তখন আয়াতুল কুরসী পড়বে। তাহলে সর্বদা আল্লাহর পক্ষ হতে তোমার জন্য একজন হিফাযতকারী থাকবে এবং সকাল হওয়া অবধি তোমার নিকট শয়তান আসতে পারবে সামাজিক না। তখন নবী সা. বললেন, সে তোমাকে সত্য বলেছে, অথচ সে মিথ্যাচারী এবং শয়তান ছিল। [সহীহ বুখারী ৩২৭৫]

সূরা আলে ইমরান সম্পর্কে : আবূ উসামা আল বাহিলী রা. বর্ণনা করেছেন, তিনি বলেন, আমি রসূলুল্লাহ সা. কে বলতে শুনেছি, তোমরা কুরআন পাঠ কর। কারন কিয়ামতের দিন তার পাঠকারীর জন্য সে শাফাআতকারী হিসেবে আসবে। তোমরা দু’টি উজ্জ্বল সূরা অর্থাৎ সূরা আল বাক্বারাহ এবং সূরা আল ইমরান পড়। ক্বিয়ামতের দিন এ দু’টি সুরা এমনভাবে আসবে যেন তা দু’খ- মেঘ অথবা দু’টি ছায়াদানকারী অথবা দু’ঝাঁক উড়ন্ত পাখি যা তার পাঠকারীর পক্ষ হয়ে কথা বলবে। [সহীহ মুসলিম ৮০৪]

সূরা ইসরা সম্পর্কে : আয়িশা রা. বর্ণনা করেছেন, সূরা বানী ইসরাঈল ও সূরা আয্-যুমার তিলাওয়াত না করা পর্যন্ত নবী সা. ঘুমাতেন না। [সুনানে তিরমিযী ২৯২০, মুসনাদে আহমদ ২৪৯০৮, সনদ হাসান]

সূরা কাফিরুন সম্পর্কে : ফরওয়াহ ইবনু নাওফাল রা. বর্ণনা করেছেন, তিনি নবী সা. এর কাছে এসে বললেন, হে আল্লাহর রাসূল! আমাকে কিছু শিখিয়ে দিন, যা আমি বিছানাগত হওয়াকালে বলতে পারি। তিনি বললেন, তুমি ‘কুল ইয়া আইয়্যুহাল কাফিরুন’ সূরাটি তিলাওয়াত কর। কারণ তা শিরক হতে মুক্তির ঘোষণা। [সুনানে তিরমিযী ৩৪০৩, সুনানে আবু দাউদ ৫০৫৫, সনদ হাসান]

সূরা ইখলাস ও সূরা ফালাক-নাস সম্পর্কে : আবদুল্লাহ ইবনু খুবাইব রা. বর্ণনা করেছেন, তিনি বলেন, এক ঘুটঘুটে অন্ধকার ও বৃষ্টিমুখর রাতে আমাদের নামায আদায় করানোর জন্য আমরা রাসূল সা. এর সন্ধানে বের হলাম। আমি তাঁর দেখা পেলে তিনি বললেন, বল। কিন্তু আমি কিছুই বললাম না। তিনি পুনরায় বললেন, বল। এবারও আমি কিছুই বললাম না। তিনি আবার বললেন, বল। এবার আমি প্রশ্ন করলাম, আমি কি বলব? তিনি বললেন, তুমি প্রতি দিন বিকালে ও সকালে তিনবার সূরা আল-ইখলাস, সূরা আল-ফালাক্ব ও সুরা আন-নাস পাঠ করবে, তাহলে তা সবকিছু থেকে তোমার জন্য যথেষ্ট হয়ে যাবে। [সুনানে তিরমিযী ৩৫৭৫, মুসনাদে আহমদ ২২৬৬৪, সনদ হাসান]

তিন.
উক্ত ফযিলত ছাড়াও সুস্থতা লাভ কিংবা বিভিন্ন আছর ও যাদু-টোনা আত্মরক্ষার উদ্দেশ্যে কুরআনের আয়াত দ্বারা ঝাড়ফুঁক করাও জায়েয। তাই শুধু এ উদ্দেশ্যে হলেও এ আয়াতগুলো পড়া যেতে পারে। ইবনে তাইমিয়া রহ. বলেন,
وَأَمَّا مُعَالَجَةُ الْمَصْرُوعِ بِالرُّقَى، وَالتَّعَوُّذَاتِ. فَهَذَا عَلَى وَجْهَيْنِ: فَإِنْ كَانَتْ الرُّقَى وَالتَّعَاوِيذُ مِمَّا يُعْرَفُ مَعْنَاهَا، وَمِمَّا يَجُوزُ فِي دِينِ الْإِسْلَامِ أَنْ يَتَكَلَّمَ بِهَا الرَّجُلُ، دَاعِيًا لِلَّهِ، ذَاكِرًا لَهُ، وَمُخَاطِبًا لِخَلْقِهِ، وَنَحْوُ ذَلِكَ، فَإِنَّهُ يَجُوزُ أَنْ يُرْقَى بِهَا الْمَصْرُوعُ، وَيُعَوَّذَ، فَإِنَّهُ قَدْ ثَبَتَ فِي الصَّحِيحِ عَنْ النَّبِيِّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -: «أَنَّهُ أَذِنَ فِي الرُّقَى، مَا لَمْ تَكُنْ شِرْكًا». وَقَالَ: «مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَفْعَلْ»، وَإِنْ كَانَ فِي ذَلِكَ كَلِمَاتٌ مُحَرَّمَةٌ مِثْلُ أَنْ يَكُونَ فِيهَا شِرْكٌ، أَوْ كَانَتْ مَجْهُولَةَ الْمَعْنَى يُحْتَمَلُ أَنْ يَكُونَ فِيهَا كُفْرٌ، فَلَيْسَ لِأَحَدٍ أَنْ يَرْقِيَ بِهَا.

অর্থ: আছরগ্রস্থ ব্যক্তিকে ঝাড়-ফুঁকের মাধ্যমে চিকিৎসা করা দুই প্রকার। তা যদি এমন শব্দ দ্বারা হয় যার অর্থ সুস্পষ্ট এবং তা ইসলামী শরীয়ত অনুযায়ী পড়াও বৈধ (যেমন, আল্লাহর কোন নাম, যিকির বা সৃষ্টিকুলকে লক্ষ করে আল্লাহর কোন সম্বোধন ইত্যাদি) দ্বারা আছরগ্রস্থ ব্যক্তিকে ঝাড়-ফুঁক করা জায়েয। কারণ, সহীহ হাদীসের বর্ণনা মতে রাসূল সা. শিরক না হলে ঝাড়-ফুঁক করার অনুমতি দিয়ে বলেছেন, তোমাদের কেউ যদি তার ভাইকে উপকার করতে সক্ষম হয় তাহলে সে যেন তা করে। আর যদি ঝাড়-ফুঁক হারাম বাক্য দ্বারা হয় (যেমন, কুফর-শিরকযুক্ত বাক্য) অথবা এমন বাক্য যার অর্থ জানা নেই (যাতে কুফর ও শিরকের সম্ভাবনা রয়েছে) তা দ্বারা ঝাড়-ফুঁক করা জায়েয নয়। [আল ফাতাওয়াল কুবরা ৩/১৩; মজমূউল ফাতাওয়া ২৪/২৭৮]

হাফেজ ইবনে হাজার আসকালানী রহ. বলেন,
وَقَدْ أَجْمَعَ الْعُلَمَاءُ عَلَى جَوَازِ الرُّقَى عِنْدَ اجْتِمَاعِ ثَلَاثَةِ شُرُوطٍ أَنْ يَكُونَ بِكَلَامِ اللَّهِ تَعَالَى أَوْ بِأَسْمَائِهِ وَصِفَاتِهِ وَبِاللِّسَانِ الْعَرَبِيِّ أَوْ بِمَا يُعْرَفُ مَعْنَاهُ مِنْ غَيْرِهِ وَأَنْ يُعْتَقَدَ أَنَّ الرُّقْيَةَ لَا تُؤَثِّرُ بِذَاتِهَا بَلْ بِذَاتِ اللَّهِ تَعَالَى.

তিনটি শর্ত বিদ্যমান থাকার শর্তে উলামায়ে কিরাম ঝাড়-ফুঁক বৈধ হওয়ার ব্যাপারে একমত। ঝাড়-ফুঁকের বাক্যগুলো আল্লাহর কালাম, তাঁর নাম এ সিফাত হতে হবে, আরবই ভাষা বা অর্থ সুস্পষ্ট এমন বাক্য দ্বারা হতে হবে এবং বিশ্বাস রাখতে হবে যে ঝাড়-ফুঁক শুধু মাধ্যম মাত্র; মূলত পতিক্রিয়া সৃষ্টি করেন আল্লাহ তায়ালা। [ফাতহুল বারী ১০/১৯৫]

এ বিষয়ে আরো দেখুন: সিলসিলাতুল আহাদীসিস সহীহা আলবানী, হাদীস নং ৪৭২; তাইসিরুল আজিজিল হামীদ শরহু কিতাবিত তাউহীদ পৃষ্ঠা নং ১৩৩, শরহুন নববী ১৪/১৬৮]

ফযিলত হিসাবে বিশেষ হাদীসের উদ্ধৃতি

মুদ্রিত মানযিলের কোন কোন সংস্করণে মানযিলের ফযিলত হিসাবে একটি বিশেষ হাদীসের উদ্ধৃতি দেওয়া হয়েছে। কোন নুসখায় মুসনাদে আহমদ থেকে কোন নুসখায় ইবনে মাযা থেকে। হাদীসটির বিবরণ এমন,
حَدَّثَنَا هَارُونُ بْنُ حَيَّانَ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى قَالَ: أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ قَالَ: حَدَّثَنَا أَبُو جَنَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أَبِيهِ أَبِي لَيْلَى قَالَ: كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَهُ أَعْرَابِيٌّ فَقَالَ: إِنَّ لِي أَخًا وَجِعًا، قَالَ: «مَا وَجَعُ أَخِيكَ؟» قَالَ: بِهِ لَمَمٌ، قَالَ: «اذْهَبْ فَأْتِنِي بِهِ». قَالَ: فَذَهَبَ فَجَاءَ بِهِ، فَأَجْلَسَهُ بَيْنَ يَدَيْهِ، فَسَمِعْتُهُ عَوَّذَهُ بِفَاتِحَةِ الْكِتَابِ، وَأَرْبَعِ آيَاتٍ مِنْ أَوَّلِ الْبَقَرَةِ، وَآيَتَيْنِ مِنْ وَسَطِهَا، {وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ}، وَآيَةِ الْكُرْسِيِّ، وَثَلَاثِ آيَاتٍ مِنْ خَاتِمَتِهَا، وَآيَةٍ مِنْ آلِ عِمْرَانَ أَحْسِبُهُ قَالَ: {شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ}، وَآيَةٍ مِنَ الْأَعْرَافِ: {إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ} الْآيَةَ، وَآيَةٍ مِنَ الْمُؤْمِنِينَ، {وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ}، وَآيَةٍ مِنَ الْجِنِّ، {وَأَنَّهُ تَعَالَى جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا}، وَعَشْرِ آيَاتٍ مِنْ أَوَّلِ الصَّافَّاتِ، وَثَلَاثِ آيَاتٍ مِنْ آخِرِ الْحَشْرِ، وَقُلْ هُوَ اللَّهُ أَحَدٌ، وَالْمُعَوِّذَتَيْنِ، فَقَامَ الْأَعْرَابِيُّ، قَدْ بَرَأَ لَيْسَ بِهِ بَأْسٌ.

অর্থ: আব্দুর রহমান ইবনে আবি লাইলা রহ. বর্ণনা করেন তাঁর পিতা আবু লাইলা থেকে। তিনি বলেন, আমি নবী সা. এর নিকট বসে থাকা অবস্থায় এক বেদুইন তাঁর নিকটে এসে বললো, আমার এক অসুস্থ ভাই আছে। তিনি বললেন, তোমার ভাই কী রোগে আক্রান্ত? সে বললো, (কোন কিছুর) কুপ্রভাব (আছর)। তিনি বললেন, তুমি যাও এবং তাকে আমার নিকট নিয়ে এসো। আবূ লায়লা রা. বলেন, সে গিয়ে তার ভাইকে নিয়ে আসলে তিনি তাকে নিজের সামনে বসলেন। আমি শুনতে পেলাম, তিনি সূরা ফাতিহা, সূরা বাকারার প্রথম চার আয়াত, সূরা বাকারার মধ্যখানের দু’আয়াত (১৬৩-১৬৪ নং আয়াত), আয়াতুল কুরসী (২৫৫ নং আয়াত) এবং বাকারার শেষ তিন আয়াত (২৮৪-২৮৬ আয়াত) এবং আল ইমরানের একটি আয়াত, আমার মনে হয় তিনি ১৮ নং আয়াত পড়েছিলেন এবং সূরা আরাফের এক আয়াত (৫৪ নং আয়াত), সূরা মুমিনূনের এক আয়াত (১১৭ নং আয়াত), সূরা জিন-এর এক আয়াত (৩ নং আয়াত), সুরা সাফ্ফাত এর প্রথম দশ আয়াত, সুরা হাশরের শেষ তিন (২২, ২৩ ও ২৪) আয়াত, সূরা ইখলাস, সূরা ফালাক ও সূরা নাস পড়ে তাকে ফুঁ দিলেন। তাতে বেদুইন এমনভাবে সুস্থ হয়ে দাঁড়ালো যে, তার কোন রোগই অবশিষ্ট নেই।

হাদীসটি যে সকল কিতাবে উদ্ধৃত হয়েছে: মুসনাদে আহমদ (হাদীস নং ২১১৭৪); সুনানে ইবনে মাজাহ (হাদীস নং ৩৫৪৯); মুসনাদে আবু ইয়লা আল-মাউসিলী (হাদীস নং ১৫৯৪); আদ্-দুআ তাবরানী (হাদীস নং ১০৮০); আমালুল ইয়াউমি ওয়াল লাইলা, ইবনুস্ সুন্নী (হাদীস নং ৬৩২); মুস্তাদরাকে হাকিম (হাদীস নং ৮২৬৯); আদ-দাউআতুল কাবীর বাইহাকী (হাদীস নং ৫৯৫); আল-আযকার নববী (হাদীস নং ৩৭৬); সিলাহুল মুমিন তকিউদ্দিন ইবনুল ইমাম (হাদীস নং ۷۷۰); আল হিসনুল হাসীন ইবনুল যাজারী

তবে প্রমাণ হিসাবে এ হাদীস উদ্ধৃত করার ক্ষেত্রে কিছু আপত্তি রয়েছে। যার কারণে এ হাদীস প্রমাণ হিসাবে পেশ করার যোগ্য বলে বিবেচিত হয় না।

১ নং আপত্তি : সনদের বিচারে হাদীসটি দুর্বল
২ নং আপত্তি : আয়াত সংখ্যার অমিল
৩ নং আপত্তি : মানযিলের যে সব ফযিলত বলা হয় তার সব এ হাদীসে নেই

এ সব কারণে মানযিলের ফযিলত হিসাবে এ হাদীসকে প্রমাণ হিসাবে পেশ করা অনুচিত। এটিকে প্রমাণ হিসাবে পেশ করার প্রয়োজনও নেই। বৈশিষ্ট্য হিসাবে প্রবন্ধের শুরুতে উল্লেখিত ফযিলত ও বৈশিষ্ট্যগুলোই যথেষ্ট।

৩৩ আয়াত এর আমল বনাম মানযিলের আমল

মানযিলের এ আমল ‘৩৩ আয়াতের আমল’ নামেও অনেকের মুখে পরিচিত। এ নামকরণের কারণ হচ্ছে, শাহ ওয়ালি উল্লাহ দেহলবী রহ. এর বংশে এ আমল ৩৩ আয়াতের আমল নামে প্রচলিত ছিল। তবে সুস্পষ্ট যে, আয়াত সংখ্যার ব্যাপারে প্রচলিত মানযিল ও উদ্ধৃত হাদীসের সাথে এর গড়মিল রয়েছে। কারণ, প্রচলিত মানযিলের আয়াত সংখ্যা ৭৯ টি, উদ্ধৃত হাদীসের আয়াত সংখ্যা ৫০টি আর এর আয়াত সংখ্যা ৩৩টি।

শাহ ওয়ালি উল্লাহ দেহলভী রহ. তার পিতার কথা উল্লেখ করে লিখেছেন,
وسمعته (يريد والده) يقول: ثلاث وثلاثون آية تنفع من السحر، وتكون حرزا من اللصوص والسباع، أربع آيات من أول البقرة، وآية الكرسي وآيتان بعدها إلى خالدون، وثلاث من آخر البقرة، وثلاث من الأعراف {إن ربكم الله} إلى {المحسنين}، وآخر بني إسرائيل {قل ادعو الله أو ادعو الرحمن}، وعشر آيات من أول الصافات إلى {لازب}، وآيتان من سورة الرحمن {يا معشر الجن} إلى {تنتصران}، وآخر سورة الحشر {لو أنزلنا هذا القرآن}، وآيتان من {قل أوحي} {وأنه تعالى جد ربنا} إلى {شططا}، فهذه هي الآيات المسميات بثلاث وثلاثين آية

আমি আমার পিতাকে বলতে শুনেছি। তিনি বলেছেন, ৩৩ টি আয়াত এমন আছে যা যাদু-টোনা থেকে রক্ষার ক্ষেত্রে উপকারী এবং চোর-ডাকাত ও হিংস্র প্রাণী থেকে আত্মরক্ষার মাধ্যম। আয়াতগুলো এই,
১. সূরা বাকারার প্রথম ۴ আয়াত
২. আয়াতুল কুরসী ও তার পরবর্তী দুই আয়াত মোট ৩ আয়াত
৩. সূরা বাকারার শেষ ৩ আয়াত
৪. সূরা আরাফ এর ৫৪, ৫৫ ও ৫৬ নং আয়াত, মোট ৩ আয়াত
৫. সূরা ইসরা এর ১১০ নং আয়াত
৬. সূরা সাফ্ফাত এর প্রথম ১০ আয়াত
৭. সূর আর রহমান এর ৩৩ ও ৩৪ নং আয়াত
৮. সূরা হাশর এর শেষ ۴ আয়াত
৯. সূরা জিন এর ৩য় ও ৪র্থ নং আয়াত
এই মোট ৩৩ আয়াত। তবে এরপরেই শাহ ওয়ালি উল্লাহ দেহলভী রহ. লিখেছেন,

وكان سيدي الوالد يزيد عليها الفاتحة، وقل أيها الكافرون، وقل هو الله أحد، والمعوذتين، ويأخذ من سورة قل {أوحي} إلى {شططا}.

তবে আমার সম্মানিত পিতা এর যোগ করতেন, সূরা ফাতিহা (৭ আয়াত), সূরা কাফিরুন (৬ আয়াত), সূরা ইখলাস (৪ আয়াত), সূরা ফালাক (৫ আয়াত), সূরা নাস (৬ আয়াত) ও সূরা জ্বিন থেকে ‘শাত্বাত্বা’ পর্যন্ত (অতিরিক্ত ২ আয়াত)। [প্রাগুক্ত]

অর্থাৎ তিনি এই ৩৩ আয়াতের সাথে আরো ৩০ আয়াত যোগ করে ৬৩ আয়াত পড়তেন।

আয়াত সংখ্যাই যাই হোক, এ আমলের ক্ষেত্রে এটি কোন বিবেচ্য বিষয় নয়; কারণ এ আমল বা এর আয়াত সংখ্যা কোন মানসূস আলাইহ (শরীয়তের পক্ষ থেকে নির্ধারিত) বিষয় নয়। তাই এতে কম-বেশ করার সুযোগ রয়েছে। আল্লাহ তায়ালা আমাদের সঠিক বুঝ দান করুন। আমীন।

(মাওলানা আবু সায়েম দাঃ)"""

    val arabicRegex = Regex("([\\u0600-\\u06FF\\u0750-\\u077F\\u08A0-\\u08FF\\uFB50-\\uFDFF\\uFE70-\\uFEFF]+[\\u0600-\\u06FF\\u0750-\\u077F\\u08A0-\\u08FF\\uFB50-\\uFDFF\\uFE70-\\uFEFF0-9\\s{}«».,:؛؟\\-]*[\\u0600-\\u06FF\\u0750-\\u077F\\u08A0-\\u08FF\\uFB50-\\uFDFF\\uFE70-\\uFEFF]+)|([\\u0600-\\u06FF\\u0750-\\u077F\\u08A0-\\u08FF\\uFB50-\\uFDFF\\uFE70-\\uFEFF]+)")
    var lastIndex = 0
    try {
        arabicRegex.findAll(text).forEach { matchResult ->
            text.substring(lastIndex, matchResult.range.first)
            lastIndex = matchResult.range.last + 1
        }
        text.substring(lastIndex)
        println("All good!")
    } catch (e: Exception) {
        println(e)
    }
}
